'=================================================(C)Copyright YTI Inc., 2007====
'   パッケージ名　　: DB接続パッケージ
'   クラス名　　　　: DB接続インタフェース
'   バージョン　　　:
'--------------------------------------------------------------------------------
'     作　成　者　　: kawasaki        2007.05.14
'     改　　　訂　　:
'================================================================================
Public Interface IDBOperate

    '--------------------------------------------------------------------------------
    '   <機　能>
    '       DBとの接続を行う
    '
    '   <戻り値>
    '       True：接続成功
    '       False：接続失敗
    '
    '   <引　数>
    '       strDataSource   [I/ ]   データソース名
    '       strUserID       [I/ ]   ユーザ名(省略可)
    '       strPassword     [I/ ]   パスワード(省略可)
    '       strCnnString    [I/ ]   その他に必要な接続文字列(省略可)
    '--------------------------------------------------------------------------------
    Function Connect( _
                    ByVal strDataSource As String, _
                    Optional ByVal strUserID As String = "", _
                    Optional ByVal strPassword As String = "", _
                    Optional ByVal strCnnString As String = "" _
    ) As Boolean

    '--------------------------------------------------------------------------------
    '   <機　能>
    '       DBとの接続を切断する
    '
    '   <戻り値>
    '       なし
    '
    '   <引　数>
    '       なし
    '--------------------------------------------------------------------------------
    Sub DisConnect()

    '--------------------------------------------------------------------------------
    '   <機　能>
    '       DBとの接続文字列を作成する
    '
    '   <戻り値>
    '       なし
    '
    '   <引　数>
    '       strDataSource   [I/ ]   データソース名
    '       strUserID       [I/ ]   ユーザ名(省略可)
    '       strPassword     [I/ ]   パスワード(省略可)
    '       strCnnString    [I/ ]   その他に必要な接続文字列(省略可)
    '--------------------------------------------------------------------------------
    Sub ConnectionString( _
                    ByVal strDataSource As String, _
                    Optional ByVal strUserID As String = "", _
                    Optional ByVal strPassword As String = "", _
                    Optional ByVal strCnnString As String = "" _
    )

    '--------------------------------------------------------------------------------
    '   <機　能>
    '       SQL文を実行する
    '
    '   <戻り値>
    '       実行レコード件数
    '
    '   <引　数>
    '       strSQL  [I/ ]   SQL文
    '--------------------------------------------------------------------------------
    Function ExecuteSQL( _
                    ByVal strSQL As String _
    ) As Long

    '--------------------------------------------------------------------------------
    '   <機　能>
    '       SQL文を実行する（集計結果を返す）
    '
    '   <戻り値>
    '       集計結果
    '
    '   <引　数>
    '       strSQL  [I/ ]   SQL文
    '--------------------------------------------------------------------------------
    Function ExecuteSQL2( _
                    ByVal strSQL As String _
    ) As Object
    '--------------------------------------------------------------------------------
    '   <機　能>
    '       SQL文を実行する（失敗時は例外スローする。）
    '
    '   <戻り値>
    '       集計結果
    '
    '   <引　数>
    '       strSQL  [I/ ]   SQL文
    '--------------------------------------------------------------------------------
    Function ExecuteSQL3( _
                    ByVal strSQL As String _
    ) As Long

    '--------------------------------------------------------------------------------
    '   <機　能>
    '       SQL文を実行する（失敗時は例外スローする。）
    '
    '   <戻り値>
    '       集計結果
    '
    '   <引　数>
    '       strSQL  [I/ ]   SQL文
    '--------------------------------------------------------------------------------
    'Function ExecuteSQL4( _
    '                ByVal strSQL As String _
    ') As Object
    '--------------------------------------------------------------------------------
    '   <機　能>
    '       テーブル名、フィールド名を指定してそのレコード数を返す
    '
    '   <戻り値>
    '       レコード数
    '
    '   <引　数>
    '       strSelect   [I/ ]   フィールド名
    '       strTable    [I/ ]   対象テーブル
    '       strWhere    [I/ ]   抽出条件(省略可:省略時は全レコードを対象)
    '--------------------------------------------------------------------------------
    Function DoDCount( _
                    ByVal strSelect As String, _
                    ByVal strTable As String, _
                    Optional ByVal strWhere As String = "" _
    ) As Long

    '--------------------------------------------------------------------------------
    '   <機　能>
    '       トランザクションの開始
    '
    '   <戻り値>
    '
    '   <引　数>
    '
    '--------------------------------------------------------------------------------
    Sub BeginTrans()

    '--------------------------------------------------------------------------------
    '   <機　能>
    '       コミット処理
    '
    '   <戻り値>
    '
    '   <引　数>
    '
    '--------------------------------------------------------------------------------
    Sub CommitTrans()

    '--------------------------------------------------------------------------------
    '   <機　能>
    '       ロールバック処理
    '
    '   <戻り値>
    '
    '   <引　数>
    '
    '--------------------------------------------------------------------------------
    Sub RollbackTrans()

    '--------------------------------------------------------------------------------
    '   <機　能>
    '       レコードの選択（Oracle）
    '
    '   <戻り値>
    '       DataReaderオブジェクト
    '
    '   <引　数>
    '       strSQL      [I/ ]   検索SQL
    '--------------------------------------------------------------------------------
    Function DoSelect( _
                    ByVal strSQL As String _
    ) As IDataReader

    '--------------------------------------------------------------------------------
    '   <機　能>
    '       レコードの更新
    '
    '   <戻り値>
    '       実行レコード数
    '
    '   <引　数>
    '       strFields() [I/ ]   更新フィールド名
    '       strTable    [I/ ]   テーブル名
    '       strValues() [I/ ]   更新値
    '       strWhere    [I/ ]   更新条件（省略時：全データ対象）
    '--------------------------------------------------------------------------------
    Function DoUpdate( _
                    ByVal strFields() As String, _
                    ByVal strTable As String, _
                    ByVal vSetValues() As String, _
                    Optional ByVal strWhere As String = "" _
    ) As Long

    '--------------------------------------------------------------------------------
    '   <機　能>
    '       レコードの登録
    '
    '   <戻り値>
    '       実行レコード数
    '
    '   <引　数>
    '       strFields() [I/ ]   登録フィールド名
    '       strTable    [I/ ]   テーブル名
    '       strValues() [I/ ]   登録値
    '--------------------------------------------------------------------------------
    Function DoInsert( _
                    ByVal strFields() As String, _
                    ByVal strTable As String, _
                    ByVal vSetValues() As String _
    ) As Long

    '--------------------------------------------------------------------------------
    '   <機　能>
    '       レコードの削除（Access）
    '
    '   <戻り値>
    '       実行レコード数
    '
    '   <引　数>
    '       strTable    [I/ ]   テーブル名
    '       strWhere    [I/ ]   削除条件（省略時：全データ対象）
    '--------------------------------------------------------------------------------
    Function DoDelete( _
                    ByVal strTable As String, _
                    Optional ByVal strWhere As String = "" _
    ) As Long


    '--------------------------------------------------------------------------------
    '   <機　能>
    '       特定カラムの値取得
    '
    '   <戻り値>
    '       検索値
    '
    '   <引　数>
    '       strSelect   [I/ ]   検索項目
    '       strTable    [I/ ]   検索テーブル名
    '       strWhere    [I/ ]   検索条件（省略可）
    '--------------------------------------------------------------------------------
    Function DoDLookup( _
                    ByVal strSelect As String, _
                    ByVal strTable As String, _
                    Optional ByVal strWhere As String = "" _
    ) As Object

    '--------------------------------------------------------------------------------
    '   <機　能>
    '       DataSetオブジェクトを取得する
    '
    '   <戻り値>
    '       DataSetオブジェクトの取得
    '
    '   <引　数>
    '       strSQL      [I/ ]   検索SQL
    '       strTable    [I/ ]   対象テーブル名
    '       bPropertyFlg[I/ ]   属性取得Flg
    '--------------------------------------------------------------------------------
    '---Rep.Start-----------------------------------------(2007.08.17) kawasaki
    'Function DoDataSet( _
    '                ByVal strSQL As String, _
    '                ByVal strTable As String _
    ') As DataSet
    '-----------------------------------------------------
    Function DoDataSet( _
                ByVal strSQL As String, _
                Optional ByVal strTable As String = "", _
                Optional ByVal bPropertyFlg As Boolean = False _
                ) As DataSet
    '---Rep. End -----------------------------------------(2007.08.17) kawasaki

    '--------------------------------------------------------------------------------
    '   <機　能>
    '       データ型による識別子追加
    '
    '   <戻り値>
    '       データ識別子付き文字列
    '
    '   <引　数>
    '       strCellValue    [I/ ]   データ
    '       strCellType     [I/ ]   データタイプ
    '--------------------------------------------------------------------------------
    Function checkDataType( _
                        ByVal strCellValue As String, _
                        ByVal strCellType As String _
    ) As String

    '--------------------------------------------------------------------------------
    '   <機　能>
    '       プロパティ値(DBコネクションオブジェクト)
    '
    '   <戻り値>
    '       なし
    '
    '   <引　数>
    '       なし
    '--------------------------------------------------------------------------------
    Property DbConnection() As IDbConnection

    '---Ins.Start-----------------------------------------(2007.09.28) kawasaki
    '--------------------------------------------------------------------------------
    '   <機　能>
    '       プロパティ値(DBトランザクションオブジェクト)
    '
    '   <戻り値>
    '       なし
    '
    '   <引　数>
    '       なし
    '--------------------------------------------------------------------------------
    Property DbTansaction() As IDbTransaction
    '---Ins. End -----------------------------------------(2007.09.28) kawasaki

    '<!--2007/12/13 T44
    '--------------------------------------------------------------------------------
    '   <機　能>
    '       .NETのコネクションオブジェクトを得る
    '
    '   <戻り値>
    '       なし
    '
    '   <引　数>
    '       なし
    '--------------------------------------------------------------------------------
    Function getConnectionObject() As Object
    '-->
    '---Ins.Start-----------------------------------------(2008.02.29) kawasaki
    '--------------------------------------------------------------------------------
    '   <機　能>
    '       レコードの選択（パラメータ付）
    '
    '   <戻り値>
    '       DataReaderオブジェクト
    '
    '   <引　数>
    '       strSQL      [I/ ]   検索SQL
    '       strParaName()   [I/ ] パラメータ名
    '       strParaVal()    [I/ ] パラメータ値
    '--------------------------------------------------------------------------------
    Function DoSelectParameter( _
                    ByVal strSQL As String, _
                    ByVal strParaName As String(), _
                    ByVal objParaVal As Object() _
    ) As IDataReader
    '---Ins. End -----------------------------------------(2008.02.29) kawasaki
    '---Ins.Start-----------------------------------------(2008.04.18) kawasaki
    '--------------------------------------------------------------------------------
    '   <機　能>
    '       BLOB型データのInsert、パラメータ付）
    '
    '   <戻り値>
    '       True    正常終了
    '       False   異常終了
    '
    '   <引　数>
    '       strSQL          [I/ ]   実行SQL
    '       strParaName     [I/ ]   パラメータ名
    '       strParaVal()    [I/ ]   パラメータ値
    '--------------------------------------------------------------------------------
    Function DoInsert_Blob( _
                    ByVal strSQL As String, _
                    ByVal strParaName As String, _
                    ByVal bytParaVal As Byte() _
    ) As Long

    '--------------------------------------------------------------------------------
    '   <機　能>
    '       プロパティ（接続文字列）
    '
    '   <戻り値>
    '       なし
    '
    '   <引　数>
    '       なし
    '--------------------------------------------------------------------------------
    Property DBConnectionString() As String

    '--------------------------------------------------------------------------------
    '   <機　能>
    '       プロパティ（エラーメッセージ）
    '
    '   <戻り値>
    '       なし
    '
    '   <引　数>
    '       なし
    '--------------------------------------------------------------------------------
    ReadOnly Property ErrorMessage() As String

    '---Ins. End -----------------------------------------(2008.04.18) kawasaki
End Interface
